SodaqMoja/SodaqCore-samd/boards.txt
# Copyright (c) 2015-2015 M2M4ALL BV.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

# SODAQ/Autonomo
# ---------------------------------------
sodaq_autonomo.name=SODAQ Autonomo
sodaq_autonomo.vid.0=0x2341
sodaq_autonomo.pid.0=0x804d
sodaq_autonomo.vid.1=0x2341
sodaq_autonomo.pid.1=0x004d
sodaq_autonomo.upload.tool=bossac
sodaq_autonomo.upload.protocol=sam-ba
sodaq_autonomo.upload.maximum_size=262144
sodaq_autonomo.upload.use_1200bps_touch=true
sodaq_autonomo.upload.wait_for_upload_port=true
sodaq_autonomo.upload.native_usb=true
sodaq_autonomo.build.mcu=cortex-m0plus
sodaq_autonomo.build.f_cpu=48000000L
sodaq_autonomo.build.usb_product="SODAQ Autonomo"
sodaq_autonomo.build.usb_manufacturer="SODAQ"
sodaq_autonomo.build.board=SODAQ_AUTONOMO
sodaq_autonomo.build.core=arduino
sodaq_autonomo.build.extra_flags=-D__SAMD21J18A__ {build.usb_flags}
sodaq_autonomo.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
sodaq_autonomo.build.openocdscript=openocd_scripts/sodaq_autonomo.cfg
sodaq_autonomo.build.variant=sodaq_autonomo
sodaq_autonomo.build.variant_system_lib=
sodaq_autonomo.build.vid=0x2341
sodaq_autonomo.build.pid=0x804d
sodaq_autonomo.bootloader.tool=openocd
sodaq_autonomo.bootloader.file=zero/samd21_sam_ba.bin

# SODAQ/Autonomo BETA
# ---------------------------------------
sodaq_autonomo_beta.name=SODAQ Autonomo BETA
sodaq_autonomo_beta.vid.0=0x2341
sodaq_autonomo_beta.pid.0=0x804d
sodaq_autonomo_beta.vid.1=0x2341
sodaq_autonomo_beta.pid.1=0x004d
sodaq_autonomo_beta.upload.tool=bossac
sodaq_autonomo_beta.upload.protocol=sam-ba
sodaq_autonomo_beta.upload.maximum_size=262144
sodaq_autonomo_beta.upload.use_1200bps_touch=true
sodaq_autonomo_beta.upload.wait_for_upload_port=true
sodaq_autonomo_beta.upload.native_usb=true
sodaq_autonomo_beta.build.mcu=cortex-m0plus
sodaq_autonomo_beta.build.f_cpu=48000000L
sodaq_autonomo_beta.build.usb_product="SODAQ Autonomo"
sodaq_autonomo_beta.build.usb_manufacturer="SODAQ"
sodaq_autonomo_beta.build.board=SODAQ_AUTONOMO
sodaq_autonomo_beta.build.core=arduino
sodaq_autonomo_beta.build.extra_flags=-D__SAMD21J18A__ {build.usb_flags} -DENABLE_BETA
sodaq_autonomo_beta.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
sodaq_autonomo_beta.build.openocdscript=openocd_scripts/sodaq_autonomo.cfg
sodaq_autonomo_beta.build.variant=sodaq_autonomo
sodaq_autonomo_beta.build.variant_system_lib=
sodaq_autonomo_beta.build.vid=0x2341
sodaq_autonomo_beta.build.pid=0x804d
sodaq_autonomo_beta.bootloader.tool=openocd
sodaq_autonomo_beta.bootloader.file=zero/samd21_sam_ba.bin

# SODAQ/Autonomo with enabled Serial2 (D6/D7)
# ---------------------------------------
sodaq_autonomo_serial2.name=SODAQ Autonomo with Serial2
sodaq_autonomo_serial2.vid.0=0x2341
sodaq_autonomo_serial2.pid.0=0x804d
sodaq_autonomo_serial2.vid.1=0x2341
sodaq_autonomo_serial2.pid.1=0x004d
sodaq_autonomo_serial2.upload.tool=bossac
sodaq_autonomo_serial2.upload.protocol=sam-ba
sodaq_autonomo_serial2.upload.maximum_size=262144
sodaq_autonomo_serial2.upload.use_1200bps_touch=true
sodaq_autonomo_serial2.upload.wait_for_upload_port=true
sodaq_autonomo_serial2.upload.native_usb=true
sodaq_autonomo_serial2.build.mcu=cortex-m0plus
sodaq_autonomo_serial2.build.f_cpu=48000000L
sodaq_autonomo_serial2.build.usb_product="SODAQ Autonomo"
sodaq_autonomo_serial2.build.usb_manufacturer="SODAQ"
sodaq_autonomo_serial2.build.board=SODAQ_AUTONOMO
sodaq_autonomo_serial2.build.core=arduino
sodaq_autonomo_serial2.build.extra_flags=-D__SAMD21J18A__ {build.usb_flags} -DENABLE_SERIAL2
sodaq_autonomo_serial2.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
sodaq_autonomo_serial2.build.openocdscript=openocd_scripts/sodaq_autonomo.cfg
sodaq_autonomo_serial2.build.variant=sodaq_autonomo
sodaq_autonomo_serial2.build.variant_system_lib=
sodaq_autonomo_serial2.build.vid=0x2341
sodaq_autonomo_serial2.build.pid=0x804d
sodaq_autonomo_serial2.bootloader.tool=openocd
sodaq_autonomo_serial2.bootloader.file=zero/samd21_sam_ba.bin

# SODAQ/Autonomo with enabled Serial3 (D12/D13)
# ---------------------------------------
sodaq_autonomo_serial3.name=SODAQ Autonomo with Serial3
sodaq_autonomo_serial3.vid.0=0x2341
sodaq_autonomo_serial3.pid.0=0x804d
sodaq_autonomo_serial3.vid.1=0x2341
sodaq_autonomo_serial3.pid.1=0x004d
sodaq_autonomo_serial3.upload.tool=bossac
sodaq_autonomo_serial3.upload.protocol=sam-ba
sodaq_autonomo_serial3.upload.maximum_size=262144
sodaq_autonomo_serial3.upload.use_1200bps_touch=true
sodaq_autonomo_serial3.upload.wait_for_upload_port=true
sodaq_autonomo_serial3.upload.native_usb=true
sodaq_autonomo_serial3.build.mcu=cortex-m0plus
sodaq_autonomo_serial3.build.f_cpu=48000000L
sodaq_autonomo_serial3.build.usb_product="SODAQ Autonomo"
sodaq_autonomo_serial3.build.usb_manufacturer="SODAQ"
sodaq_autonomo_serial3.build.board=SODAQ_AUTONOMO
sodaq_autonomo_serial3.build.core=arduino
sodaq_autonomo_serial3.build.extra_flags=-D__SAMD21J18A__ {build.usb_flags} -DENABLE_SERIAL3
sodaq_autonomo_serial3.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
sodaq_autonomo_serial3.build.openocdscript=openocd_scripts/sodaq_autonomo.cfg
sodaq_autonomo_serial3.build.variant=sodaq_autonomo
sodaq_autonomo_serial3.build.variant_system_lib=
sodaq_autonomo_serial3.build.vid=0x2341
sodaq_autonomo_serial3.build.pid=0x804d
sodaq_autonomo_serial3.bootloader.tool=openocd
sodaq_autonomo_serial3.bootloader.file=zero/samd21_sam_ba.bin

# SODAQ/Autonomo with enabled Serial2 (D6/D7) and Serial3 (D12/D13)
# ---------------------------------------
sodaq_autonomo_serial23.name=SODAQ Autonomo with Serial2 and Serial3
sodaq_autonomo_serial23.vid.0=0x2341
sodaq_autonomo_serial23.pid.0=0x804d
sodaq_autonomo_serial23.vid.1=0x2341
sodaq_autonomo_serial23.pid.1=0x004d
sodaq_autonomo_serial23.upload.tool=bossac
sodaq_autonomo_serial23.upload.protocol=sam-ba
sodaq_autonomo_serial23.upload.maximum_size=262144
sodaq_autonomo_serial23.upload.use_1200bps_touch=true
sodaq_autonomo_serial23.upload.wait_for_upload_port=true
sodaq_autonomo_serial23.upload.native_usb=true
sodaq_autonomo_serial23.build.mcu=cortex-m0plus
sodaq_autonomo_serial23.build.f_cpu=48000000L
sodaq_autonomo_serial23.build.usb_product="SODAQ Autonomo"
sodaq_autonomo_serial23.build.usb_manufacturer="SODAQ"
sodaq_autonomo_serial23.build.board=SODAQ_AUTONOMO
sodaq_autonomo_serial23.build.core=arduino
sodaq_autonomo_serial23.build.extra_flags=-D__SAMD21J18A__ {build.usb_flags} -DENABLE_SERIAL2 -DENABLE_SERIAL3
sodaq_autonomo_serial23.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
sodaq_autonomo_serial23.build.openocdscript=openocd_scripts/sodaq_autonomo.cfg
sodaq_autonomo_serial23.build.variant=sodaq_autonomo
sodaq_autonomo_serial23.build.variant_system_lib=
sodaq_autonomo_serial23.build.vid=0x2341
sodaq_autonomo_serial23.build.pid=0x804d
sodaq_autonomo_serial23.bootloader.tool=openocd
sodaq_autonomo_serial23.bootloader.file=zero/samd21_sam_ba.bin

# SODAQ/Autonomo with enabled SPI1 (D5..D8)
# ---------------------------------------
sodaq_autonomo_spi1.name=SODAQ Autonomo with SPI1
sodaq_autonomo_spi1.vid.0=0x2341
sodaq_autonomo_spi1.pid.0=0x804d
sodaq_autonomo_spi1.vid.1=0x2341
sodaq_autonomo_spi1.pid.1=0x004d
sodaq_autonomo_spi1.upload.tool=bossac
sodaq_autonomo_spi1.upload.protocol=sam-ba
sodaq_autonomo_spi1.upload.maximum_size=262144
sodaq_autonomo_spi1.upload.use_1200bps_touch=true
sodaq_autonomo_spi1.upload.wait_for_upload_port=true
sodaq_autonomo_spi1.upload.native_usb=true
sodaq_autonomo_spi1.build.mcu=cortex-m0plus
sodaq_autonomo_spi1.build.f_cpu=48000000L
sodaq_autonomo_spi1.build.usb_product="SODAQ Autonomo"
sodaq_autonomo_spi1.build.usb_manufacturer="SODAQ"
sodaq_autonomo_spi1.build.board=SODAQ_AUTONOMO
sodaq_autonomo_spi1.build.core=arduino
sodaq_autonomo_spi1.build.extra_flags=-D__SAMD21J18A__ {build.usb_flags} -DENABLE_SPI1
sodaq_autonomo_spi1.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
sodaq_autonomo_spi1.build.openocdscript=openocd_scripts/sodaq_autonomo.cfg
sodaq_autonomo_spi1.build.variant=sodaq_autonomo
sodaq_autonomo_spi1.build.variant_system_lib=
sodaq_autonomo_spi1.build.vid=0x2341
sodaq_autonomo_spi1.build.pid=0x804d
sodaq_autonomo_spi1.bootloader.tool=openocd
sodaq_autonomo_spi1.bootloader.file=zero/samd21_sam_ba.bin

# SODAQ/WDT
# ---------------------------------------
sodaq_wdt.name=SODAQ WDT
sodaq_wdt.vid.0=0x2341
sodaq_wdt.pid.0=0x804d
sodaq_wdt.vid.1=0x2341
sodaq_wdt.pid.1=0x004d
sodaq_wdt.upload.tool=bossac
sodaq_wdt.upload.protocol=sam-ba
sodaq_wdt.upload.maximum_size=262144
sodaq_wdt.upload.use_1200bps_touch=true
sodaq_wdt.upload.wait_for_upload_port=true
sodaq_wdt.upload.native_usb=true
sodaq_wdt.build.mcu=cortex-m0plus
sodaq_wdt.build.f_cpu=48000000L
sodaq_wdt.build.usb_product="SODAQ WDT"
sodaq_wdt.build.usb_manufacturer="SODAQ"
sodaq_wdt.build.board=SODAQ_WDT
sodaq_wdt.build.core=arduino
sodaq_wdt.build.extra_flags=-D__SAMD21J18A__ {build.usb_flags} -DENABLE_SERIAL3
sodaq_wdt.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
sodaq_wdt.build.openocdscript=openocd_scripts/sodaq_wdt.cfg
sodaq_wdt.build.variant=sodaq_wdt
sodaq_wdt.build.variant_system_lib=
sodaq_wdt.build.vid=0x2341
sodaq_wdt.build.pid=0x804d
sodaq_wdt.bootloader.tool=openocd
sodaq_wdt.bootloader.file=zero/samd21_sam_ba.bin

# SODAQ/LoRaONE Beta
# ---------------------------------------
sodaq_loraone_beta.name=SODAQ LoRaONE Beta
sodaq_loraone_beta.vid.0=0x2341
sodaq_loraone_beta.pid.0=0x804d
sodaq_loraone_beta.vid.1=0x2341
sodaq_loraone_beta.pid.1=0x004d
sodaq_loraone_beta.upload.tool=bossac
sodaq_loraone_beta.upload.protocol=sam-ba
sodaq_loraone_beta.upload.maximum_size=262144
sodaq_loraone_beta.upload.use_1200bps_touch=true
sodaq_loraone_beta.upload.wait_for_upload_port=true
sodaq_loraone_beta.upload.native_usb=true
sodaq_loraone_beta.build.mcu=cortex-m0plus
sodaq_loraone_beta.build.f_cpu=48000000L
sodaq_loraone_beta.build.usb_product="SODAQ LoRaONE"
sodaq_loraone_beta.build.usb_manufacturer="SODAQ"
sodaq_loraone_beta.build.board=SODAQ_LORAONE
sodaq_loraone_beta.build.core=arduino
sodaq_loraone_beta.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
sodaq_loraone_beta.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
sodaq_loraone_beta.build.openocdscript=openocd_scripts/sodaq_loraone_beta.cfg
sodaq_loraone_beta.build.variant=sodaq_loraone_beta
sodaq_loraone_beta.build.variant_system_lib=
sodaq_loraone_beta.build.vid=0x2341
sodaq_loraone_beta.build.pid=0x804d
sodaq_loraone_beta.bootloader.tool=openocd
sodaq_loraone_beta.bootloader.file=zero/samd21_sam_ba.bin

# SODAQ ONE
# ---------------------------------------
sodaq_one.name=SODAQ ONE
sodaq_one.vid.0=0x2341
sodaq_one.pid.0=0x804d
sodaq_one.vid.1=0x2341
sodaq_one.pid.1=0x004d
sodaq_one.upload.tool=bossac
sodaq_one.upload.protocol=sam-ba
sodaq_one.upload.maximum_size=262144
sodaq_one.upload.use_1200bps_touch=true
sodaq_one.upload.wait_for_upload_port=true
sodaq_one.upload.native_usb=true
sodaq_one.build.mcu=cortex-m0plus
sodaq_one.build.f_cpu=48000000L
sodaq_one.build.usb_product="SODAQ ONE"
sodaq_one.build.usb_manufacturer="SODAQ"
sodaq_one.build.board=SODAQ_ONE
sodaq_one.build.core=arduino
sodaq_one.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
sodaq_one.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
sodaq_one.build.openocdscript=openocd_scripts/sodaq_one.cfg
sodaq_one.build.variant=sodaq_one
sodaq_one.build.variant_system_lib=
sodaq_one.build.vid=0x2341
sodaq_one.build.pid=0x804d
sodaq_one.bootloader.tool=openocd
sodaq_one.bootloader.file=zero/samd21_sam_ba.bin
